{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2026-01-03T11:16:47.151225Z",
     "start_time": "2026-01-03T11:16:45.185284Z"
    }
   },
   "source": [
    "from services.queue.sqs_manager import SQSQueueManager\n",
    "\n",
    "sqs = SQSQueueManager()\n",
    "\n",
    "jobs = sqs.get_queued_jobs()"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\u001B[1mLogfire\u001B[0m project URL: \u001B]8;id=863611;https://logfire-eu.pydantic.dev/perdomo-devega/graph-service\u001B\\\u001B[4;36mhttps://logfire-eu.pydantic.dev/perdomo-devega/graph-service\u001B[0m\u001B]8;;\u001B\\\n"
      ],
      "text/html": [
       "<pre style=\"white-space:pre;overflow-x:auto;line-height:normal;font-family:Menlo,'DejaVu Sans Mono',consolas,'Courier New',monospace\"><span style=\"font-weight: bold\">Logfire</span> project URL: <a href=\"https://logfire-eu.pydantic.dev/perdomo-devega/graph-service\" target=\"_blank\"><span style=\"color: #008080; text-decoration-color: #008080; text-decoration: underline\">https://logfire-eu.pydantic.dev/perdomo-devega/graph-service</span></a>\n",
       "</pre>\n"
      ]
     },
     "metadata": {},
     "output_type": "display_data",
     "jetTransient": {
      "display_id": null
     }
    }
   ],
   "execution_count": 1
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T11:16:54.932878Z",
     "start_time": "2026-01-03T11:16:54.924769Z"
    }
   },
   "cell_type": "code",
   "source": "jobs",
   "id": "81af846708ef89f0",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[Job(job_id='0ff98202-9afc-4858-b079-a1db87b6874f', operation='min_path', payload={'start_word': 'dog', 'end_word': 'dig', 'max_depth': '10', 'degree': 'None'}, callback_url='http://localhost:9000/callback', result=None, receipt_handle='AQEBFJd4tBgFEklxkU6lU0gZnIi5IkuKc1KqeD5u3TJXW0eZzdhgrHSEfsTAz/WAOPvKiKUPkvTlZlEhBmwH0ttUdIb4jkiAa9rO+ZVFhtI6WvDfAc84tTpgIaT/Y6HhaZNqXqXMM/2BIbRQVx37/ibsIh3ldPpr3QI20iHZyTiRoq3uaCsxWsFxPLq24cbh8Wd+ixQXdUbLAJfLfbwz/Rm3rPbHPADl8/kPAOMbI+m6zwY0eEkJU6pFCc5DkYwv1/dbUwXIjrLXlJopUmU6sMLiFA2qfzzZwDndl5ZwZ6+ts7VyCajNAIT9EBy2osT/9HrSDHp3HAwRh7awnUW0LctnalY8ashiljNkrSR9F6jdVNSG6rh69MumRg0gFXIFamysqWJjqw+vm2CoFwwqQEkkaA=='),\n",
       " Job(job_id='d2a5ce96-f492-474e-a43e-b4998920c744', operation='min_path', payload={'start_word': 'dog', 'end_word': 'dig', 'max_depth': '10', 'degree': 'None'}, callback_url='http://localhost:9000/callback', result=None, receipt_handle='AQEBNB+cBNN35gwDG29pDyQNm10owLFCxViz+SI8ioSLXeRE4peX+9UqVGVG22rDH6g+H6UYZdejc56vGErcP00cNUJrg+8Vu3DcAkbyIO3VusNS3tE8D9W1dux6S6iwAKdqlQa0XTviBiPyXdNqLqFWZxUo4G1yeQo+dOseEcRXMRZ7ZESKgnN1PpDZLj2M6HY0AfT1Gy8VRsNCvKWP8lkfFotWNnUXmn9Mh4Kpr97KGkJ7TTZNXuF4OZXjrJKjDx8bLSW8VxW1G6n94wcj/3krJ06ZloWw0FFUQN++FVu1mAjWWMHu74qsa46LxvbVe/eKXcGxytTL65Bj2Xo+aafeLTyO+5FYnszyGgaFjpFf1J8zWSiIDJuhleKOITxvTIoKpr+1XwreU9JPbvoaqd05uA==')]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T11:13:40.589838Z",
     "start_time": "2026-01-03T11:13:39.561734Z"
    }
   },
   "cell_type": "code",
   "source": [
    "response = sqs.sqs_client.receive_message(\n",
    "                QueueUrl=sqs.queue_url,\n",
    "                MaxNumberOfMessages=10,\n",
    "                WaitTimeSeconds=5\n",
    "            )\n",
    "\n",
    "messages = response.get(\"Messages\", [])\n",
    "messages[0]"
   ],
   "id": "daee28396d5d771c",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'MessageId': 'ee2cae53-d0d7-49d3-af49-b75bc518980c',\n",
       " 'ReceiptHandle': 'AQEBDIJF4PA8DBlpSreS9jZ9TeHiVHiEh+OuzIj3tBHyrrehNq/0Yu00PT/0ronDLOoXx/gm59MEK+pltS7K7u0JdX1QtlROQBKRyApfnNMWlZ0k8YIuPgwVeCweLhxYXaT8LarUSNTKwmi6NazpamxtSOt6oJstXXeJHJmRpLFVunvj7Fg17A/wuJSf4u4Q8eKScvhdy4HggYk31FbnuCqwY0ysM12d1H2tg1ofLeMg7BoEaLKKYgCf9EzFEUPmStIz/PwQyL4NJgtgf7Yye8L6vkTQm/BPFWjgKN7XGDkYLYq97Betj9RgBX484gmH4KqXvWZexGib2aIIG3rT1B77XjXdbV45+e/bTtaR3hzkMDJfCemm7B0TmE1OLhO/JgJQdcQrCnQ0CPPknb/V9VYg6A==',\n",
       " 'MD5OfBody': 'f0ae4159526df6d2bb919beddc01d28d',\n",
       " 'Body': '{\"job_id\": \"0ff98202-9afc-4858-b079-a1db87b6874f\", \"operation\": \"min_path\", \"start_word\": \"dog\", \"end_word\": \"dig\", \"max_depth\": \"10\", \"degree\": \"None\", \"callback_url\": \"http://localhost:9000/callback\"}'}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T11:13:59.218654Z",
     "start_time": "2026-01-03T11:13:58.818212Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from services.queue.job_creation import get_job_from_sqs_message\n",
    "\n",
    "get_job_from_sqs_message(messages[0])"
   ],
   "id": "1d262674d434f00c",
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "BaseModel.__init__() takes 1 positional argument but 7 were given",
     "output_type": "error",
     "traceback": [
      "\u001B[31m---------------------------------------------------------------------------\u001B[39m",
      "\u001B[31mTypeError\u001B[39m                                 Traceback (most recent call last)",
      "\u001B[36mCell\u001B[39m\u001B[36m \u001B[39m\u001B[32mIn[3]\u001B[39m\u001B[32m, line 3\u001B[39m\n\u001B[32m      1\u001B[39m \u001B[38;5;28;01mfrom\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[34;01mservices\u001B[39;00m\u001B[34;01m.\u001B[39;00m\u001B[34;01mqueue\u001B[39;00m\u001B[34;01m.\u001B[39;00m\u001B[34;01mjob_creation\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[38;5;28;01mimport\u001B[39;00m get_job_from_sqs_message\n\u001B[32m----> \u001B[39m\u001B[32m3\u001B[39m \u001B[43mget_job_from_sqs_message\u001B[49m\u001B[43m(\u001B[49m\u001B[43mmessages\u001B[49m\u001B[43m[\u001B[49m\u001B[32;43m0\u001B[39;49m\u001B[43m]\u001B[49m\u001B[43m)\u001B[49m\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\services\\queue\\job_creation.py:14\u001B[39m, in \u001B[36mget_job_from_sqs_message\u001B[39m\u001B[34m(msg)\u001B[39m\n\u001B[32m     11\u001B[39m callback_url = body.get(\u001B[33m\"\u001B[39m\u001B[33mcallback_url\u001B[39m\u001B[33m\"\u001B[39m)\n\u001B[32m     12\u001B[39m payload = get_payload(body)\n\u001B[32m---> \u001B[39m\u001B[32m14\u001B[39m \u001B[38;5;28;01mreturn\u001B[39;00m \u001B[43mJob\u001B[49m\u001B[43m(\u001B[49m\u001B[43mjob_id\u001B[49m\u001B[43m,\u001B[49m\u001B[43m \u001B[49m\u001B[43moperation\u001B[49m\u001B[43m,\u001B[49m\u001B[43m \u001B[49m\u001B[43mpayload\u001B[49m\u001B[43m,\u001B[49m\u001B[43m \u001B[49m\u001B[43mcallback_url\u001B[49m\u001B[43m,\u001B[49m\u001B[43m \u001B[49m\u001B[38;5;28;43;01mNone\u001B[39;49;00m\u001B[43m,\u001B[49m\u001B[43m \u001B[49m\u001B[43mreceipt_handle\u001B[49m\u001B[43m)\u001B[49m\n",
      "\u001B[31mTypeError\u001B[39m: BaseModel.__init__() takes 1 positional argument but 7 were given"
     ]
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T11:04:26.841712Z",
     "start_time": "2026-01-03T11:04:26.496881Z"
    }
   },
   "cell_type": "code",
   "source": "ms[0]",
   "id": "9e489240fcc39f93",
   "outputs": [
    {
     "ename": "IndexError",
     "evalue": "list index out of range",
     "output_type": "error",
     "traceback": [
      "\u001B[31m---------------------------------------------------------------------------\u001B[39m",
      "\u001B[31mIndexError\u001B[39m                                Traceback (most recent call last)",
      "\u001B[36mCell\u001B[39m\u001B[36m \u001B[39m\u001B[32mIn[2]\u001B[39m\u001B[32m, line 1\u001B[39m\n\u001B[32m----> \u001B[39m\u001B[32m1\u001B[39m \u001B[43mms\u001B[49m\u001B[43m[\u001B[49m\u001B[32;43m0\u001B[39;49m\u001B[43m]\u001B[49m\n",
      "\u001B[31mIndexError\u001B[39m: list index out of range"
     ]
    }
   ],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T10:41:30.940940Z",
     "start_time": "2026-01-03T10:41:30.934542Z"
    }
   },
   "cell_type": "code",
   "source": [
    "import json\n",
    "\n",
    "json.loads('{\"1\": \"1\"}')"
   ],
   "id": "a2c8fb751a19d18e",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'1': '1'}"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 18
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T10:41:42.403824Z",
     "start_time": "2026-01-03T10:41:42.397640Z"
    }
   },
   "cell_type": "code",
   "source": "json.loads(ms[0].get('body')).get('job_id')",
   "id": "d5b82fbacc7398e1",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0ff98202-9afc-4858-b079-a1db87b6874f\n"
     ]
    }
   ],
   "execution_count": 19
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T12:32:24.767674Z",
     "start_time": "2026-01-03T12:32:24.763563Z"
    }
   },
   "cell_type": "code",
   "source": [
    "if {\"1\": 1}:\n",
    "    print(1)"
   ],
   "id": "b81fafa319c1b9d",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T12:10:30.031780Z",
     "start_time": "2026-01-03T12:10:29.966200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from services.cache.redis_manager import RedisManager\n",
    "\n",
    "redis = RedisManager()\n",
    "if await redis.create_new_job_status(\"test1\"):\n",
    "    print(\"Creado\")\n",
    "else:\n",
    "    print(\"Tu padre\")"
   ],
   "id": "54de21e647773766",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tu padre\n"
     ]
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T11:04:26.873688400Z",
     "start_time": "2026-01-03T11:03:37.704388Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from services.queue.job_creation import get_job_from_sqs_message\n",
    "\n",
    "print(get_job_from_sqs_message(ms[0]))"
   ],
   "id": "3a4c2132e3002d59",
   "outputs": [
    {
     "ename": "KeyError",
     "evalue": "'Body'",
     "output_type": "error",
     "traceback": [
      "\u001B[31m---------------------------------------------------------------------------\u001B[39m",
      "\u001B[31mKeyError\u001B[39m                                  Traceback (most recent call last)",
      "\u001B[36mCell\u001B[39m\u001B[36m \u001B[39m\u001B[32mIn[21]\u001B[39m\u001B[32m, line 3\u001B[39m\n\u001B[32m      1\u001B[39m \u001B[38;5;28;01mfrom\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[34;01mservices\u001B[39;00m\u001B[34;01m.\u001B[39;00m\u001B[34;01mqueue\u001B[39;00m\u001B[34;01m.\u001B[39;00m\u001B[34;01mjob_creation\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[38;5;28;01mimport\u001B[39;00m get_job_from_sqs_message\n\u001B[32m----> \u001B[39m\u001B[32m3\u001B[39m \u001B[38;5;28mprint\u001B[39m(\u001B[43mget_job_from_sqs_message\u001B[49m\u001B[43m(\u001B[49m\u001B[43mms\u001B[49m\u001B[43m[\u001B[49m\u001B[32;43m0\u001B[39;49m\u001B[43m]\u001B[49m\u001B[43m)\u001B[49m)\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\services\\queue\\job_creation.py:15\u001B[39m, in \u001B[36mget_job_from_sqs_message\u001B[39m\u001B[34m(msg)\u001B[39m\n\u001B[32m     14\u001B[39m \u001B[38;5;28;01mdef\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[34mget_job_from_sqs_message\u001B[39m(msg):\n\u001B[32m---> \u001B[39m\u001B[32m15\u001B[39m     body = json.loads(\u001B[43mmsg\u001B[49m\u001B[43m[\u001B[49m\u001B[33;43m\"\u001B[39;49m\u001B[33;43mBody\u001B[39;49m\u001B[33;43m\"\u001B[39;49m\u001B[43m]\u001B[49m)\n\u001B[32m     16\u001B[39m     receipt_handle = msg.get(\u001B[33m\"\u001B[39m\u001B[33mReceiptHandle\u001B[39m\u001B[33m\"\u001B[39m)\n\u001B[32m     18\u001B[39m     job_id = body.get(\u001B[33m\"\u001B[39m\u001B[33mjob_id\u001B[39m\u001B[33m\"\u001B[39m)\n",
      "\u001B[31mKeyError\u001B[39m: 'Body'"
     ]
    }
   ],
   "execution_count": 21
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T13:50:54.808720Z",
     "start_time": "2026-01-03T13:50:49.006332Z"
    }
   },
   "cell_type": "code",
   "source": [
    "import asyncio\n",
    "import httpx\n",
    "\n",
    "async def send_job(session: httpx.AsyncClient, job_data: dict):\n",
    "    url = \"http://localhost:3000/jobs\"\n",
    "    response = await session.post(url, json=job_data)\n",
    "    response.raise_for_status()\n",
    "    return response.json()\n",
    "\n",
    "async def send_multiple_jobs(job_list: list[dict]):\n",
    "    async with httpx.AsyncClient() as client:\n",
    "        tasks = [send_job(client, job) for job in job_list]\n",
    "        results = await asyncio.gather(*tasks)\n",
    "        return results\n",
    "\n",
    "# Ejemplo de uso\n",
    "jobs_to_send = [\n",
    "    {\n",
    "        \"operation\": \"min_path\",\n",
    "        \"start_word\": \"dog\",\n",
    "        \"end_word\": \"dig\",\n",
    "        \"callback_url\": \"http://localhost:9000/callback\"\n",
    "    }\n",
    "] * 10\n",
    "\n",
    "results = await send_multiple_jobs(jobs_to_send)\n",
    "print(results)"
   ],
   "id": "15ca6d35b20c9c69",
   "outputs": [
    {
     "ename": "ReadTimeout",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001B[31m---------------------------------------------------------------------------\u001B[39m",
      "\u001B[31mReadTimeout\u001B[39m                               Traceback (most recent call last)",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_transports\\default.py:101\u001B[39m, in \u001B[36mmap_httpcore_exceptions\u001B[39m\u001B[34m()\u001B[39m\n\u001B[32m    100\u001B[39m \u001B[38;5;28;01mtry\u001B[39;00m:\n\u001B[32m--> \u001B[39m\u001B[32m101\u001B[39m     \u001B[38;5;28;01myield\u001B[39;00m\n\u001B[32m    102\u001B[39m \u001B[38;5;28;01mexcept\u001B[39;00m \u001B[38;5;167;01mException\u001B[39;00m \u001B[38;5;28;01mas\u001B[39;00m exc:\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_transports\\default.py:394\u001B[39m, in \u001B[36mAsyncHTTPTransport.handle_async_request\u001B[39m\u001B[34m(self, request)\u001B[39m\n\u001B[32m    393\u001B[39m \u001B[38;5;28;01mwith\u001B[39;00m map_httpcore_exceptions():\n\u001B[32m--> \u001B[39m\u001B[32m394\u001B[39m     resp = \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._pool.handle_async_request(req)\n\u001B[32m    396\u001B[39m \u001B[38;5;28;01massert\u001B[39;00m \u001B[38;5;28misinstance\u001B[39m(resp.stream, typing.AsyncIterable)\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpcore\\_async\\connection_pool.py:256\u001B[39m, in \u001B[36mAsyncConnectionPool.handle_async_request\u001B[39m\u001B[34m(self, request)\u001B[39m\n\u001B[32m    255\u001B[39m     \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._close_connections(closing)\n\u001B[32m--> \u001B[39m\u001B[32m256\u001B[39m     \u001B[38;5;28;01mraise\u001B[39;00m exc \u001B[38;5;28;01mfrom\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[38;5;28;01mNone\u001B[39;00m\n\u001B[32m    258\u001B[39m \u001B[38;5;66;03m# Return the response. Note that in this case we still have to manage\u001B[39;00m\n\u001B[32m    259\u001B[39m \u001B[38;5;66;03m# the point at which the response is closed.\u001B[39;00m\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpcore\\_async\\connection_pool.py:236\u001B[39m, in \u001B[36mAsyncConnectionPool.handle_async_request\u001B[39m\u001B[34m(self, request)\u001B[39m\n\u001B[32m    234\u001B[39m \u001B[38;5;28;01mtry\u001B[39;00m:\n\u001B[32m    235\u001B[39m     \u001B[38;5;66;03m# Send the request on the assigned connection.\u001B[39;00m\n\u001B[32m--> \u001B[39m\u001B[32m236\u001B[39m     response = \u001B[38;5;28;01mawait\u001B[39;00m connection.handle_async_request(\n\u001B[32m    237\u001B[39m         pool_request.request\n\u001B[32m    238\u001B[39m     )\n\u001B[32m    239\u001B[39m \u001B[38;5;28;01mexcept\u001B[39;00m ConnectionNotAvailable:\n\u001B[32m    240\u001B[39m     \u001B[38;5;66;03m# In some cases a connection may initially be available to\u001B[39;00m\n\u001B[32m    241\u001B[39m     \u001B[38;5;66;03m# handle a request, but then become unavailable.\u001B[39;00m\n\u001B[32m    242\u001B[39m     \u001B[38;5;66;03m#\u001B[39;00m\n\u001B[32m    243\u001B[39m     \u001B[38;5;66;03m# In this case we clear the connection and try again.\u001B[39;00m\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpcore\\_async\\connection.py:103\u001B[39m, in \u001B[36mAsyncHTTPConnection.handle_async_request\u001B[39m\u001B[34m(self, request)\u001B[39m\n\u001B[32m    101\u001B[39m     \u001B[38;5;28;01mraise\u001B[39;00m exc\n\u001B[32m--> \u001B[39m\u001B[32m103\u001B[39m \u001B[38;5;28;01mreturn\u001B[39;00m \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._connection.handle_async_request(request)\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpcore\\_async\\http11.py:136\u001B[39m, in \u001B[36mAsyncHTTP11Connection.handle_async_request\u001B[39m\u001B[34m(self, request)\u001B[39m\n\u001B[32m    135\u001B[39m         \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._response_closed()\n\u001B[32m--> \u001B[39m\u001B[32m136\u001B[39m \u001B[38;5;28;01mraise\u001B[39;00m exc\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpcore\\_async\\http11.py:106\u001B[39m, in \u001B[36mAsyncHTTP11Connection.handle_async_request\u001B[39m\u001B[34m(self, request)\u001B[39m\n\u001B[32m     97\u001B[39m \u001B[38;5;28;01masync\u001B[39;00m \u001B[38;5;28;01mwith\u001B[39;00m Trace(\n\u001B[32m     98\u001B[39m     \u001B[33m\"\u001B[39m\u001B[33mreceive_response_headers\u001B[39m\u001B[33m\"\u001B[39m, logger, request, kwargs\n\u001B[32m     99\u001B[39m ) \u001B[38;5;28;01mas\u001B[39;00m trace:\n\u001B[32m    100\u001B[39m     (\n\u001B[32m    101\u001B[39m         http_version,\n\u001B[32m    102\u001B[39m         status,\n\u001B[32m    103\u001B[39m         reason_phrase,\n\u001B[32m    104\u001B[39m         headers,\n\u001B[32m    105\u001B[39m         trailing_data,\n\u001B[32m--> \u001B[39m\u001B[32m106\u001B[39m     ) = \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._receive_response_headers(**kwargs)\n\u001B[32m    107\u001B[39m     trace.return_value = (\n\u001B[32m    108\u001B[39m         http_version,\n\u001B[32m    109\u001B[39m         status,\n\u001B[32m    110\u001B[39m         reason_phrase,\n\u001B[32m    111\u001B[39m         headers,\n\u001B[32m    112\u001B[39m     )\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpcore\\_async\\http11.py:177\u001B[39m, in \u001B[36mAsyncHTTP11Connection._receive_response_headers\u001B[39m\u001B[34m(self, request)\u001B[39m\n\u001B[32m    176\u001B[39m \u001B[38;5;28;01mwhile\u001B[39;00m \u001B[38;5;28;01mTrue\u001B[39;00m:\n\u001B[32m--> \u001B[39m\u001B[32m177\u001B[39m     event = \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._receive_event(timeout=timeout)\n\u001B[32m    178\u001B[39m     \u001B[38;5;28;01mif\u001B[39;00m \u001B[38;5;28misinstance\u001B[39m(event, h11.Response):\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpcore\\_async\\http11.py:217\u001B[39m, in \u001B[36mAsyncHTTP11Connection._receive_event\u001B[39m\u001B[34m(self, timeout)\u001B[39m\n\u001B[32m    216\u001B[39m \u001B[38;5;28;01mif\u001B[39;00m event \u001B[38;5;129;01mis\u001B[39;00m h11.NEED_DATA:\n\u001B[32m--> \u001B[39m\u001B[32m217\u001B[39m     data = \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._network_stream.read(\n\u001B[32m    218\u001B[39m         \u001B[38;5;28mself\u001B[39m.READ_NUM_BYTES, timeout=timeout\n\u001B[32m    219\u001B[39m     )\n\u001B[32m    221\u001B[39m     \u001B[38;5;66;03m# If we feed this case through h11 we'll raise an exception like:\u001B[39;00m\n\u001B[32m    222\u001B[39m     \u001B[38;5;66;03m#\u001B[39;00m\n\u001B[32m    223\u001B[39m     \u001B[38;5;66;03m#     httpcore.RemoteProtocolError: can't handle event type\u001B[39;00m\n\u001B[32m   (...)\u001B[39m\u001B[32m    227\u001B[39m     \u001B[38;5;66;03m# perspective. Instead we handle this case distinctly and treat\u001B[39;00m\n\u001B[32m    228\u001B[39m     \u001B[38;5;66;03m# it as a ConnectError.\u001B[39;00m\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpcore\\_backends\\anyio.py:32\u001B[39m, in \u001B[36mAnyIOStream.read\u001B[39m\u001B[34m(self, max_bytes, timeout)\u001B[39m\n\u001B[32m     26\u001B[39m exc_map = {\n\u001B[32m     27\u001B[39m     \u001B[38;5;167;01mTimeoutError\u001B[39;00m: ReadTimeout,\n\u001B[32m     28\u001B[39m     anyio.BrokenResourceError: ReadError,\n\u001B[32m     29\u001B[39m     anyio.ClosedResourceError: ReadError,\n\u001B[32m     30\u001B[39m     anyio.EndOfStream: ReadError,\n\u001B[32m     31\u001B[39m }\n\u001B[32m---> \u001B[39m\u001B[32m32\u001B[39m \u001B[38;5;28;01mwith\u001B[39;00m map_exceptions(exc_map):\n\u001B[32m     33\u001B[39m     \u001B[38;5;28;01mwith\u001B[39;00m anyio.fail_after(timeout):\n",
      "\u001B[36mFile \u001B[39m\u001B[32mC:\\Program Files\\WindowsApps\\PythonSoftwareFoundation.Python.3.12_3.12.2800.0_x64__qbz5n2kfra8p0\\Lib\\contextlib.py:158\u001B[39m, in \u001B[36m_GeneratorContextManager.__exit__\u001B[39m\u001B[34m(self, typ, value, traceback)\u001B[39m\n\u001B[32m    157\u001B[39m \u001B[38;5;28;01mtry\u001B[39;00m:\n\u001B[32m--> \u001B[39m\u001B[32m158\u001B[39m     \u001B[38;5;28;43mself\u001B[39;49m\u001B[43m.\u001B[49m\u001B[43mgen\u001B[49m\u001B[43m.\u001B[49m\u001B[43mthrow\u001B[49m\u001B[43m(\u001B[49m\u001B[43mvalue\u001B[49m\u001B[43m)\u001B[49m\n\u001B[32m    159\u001B[39m \u001B[38;5;28;01mexcept\u001B[39;00m \u001B[38;5;167;01mStopIteration\u001B[39;00m \u001B[38;5;28;01mas\u001B[39;00m exc:\n\u001B[32m    160\u001B[39m     \u001B[38;5;66;03m# Suppress StopIteration *unless* it's the same exception that\u001B[39;00m\n\u001B[32m    161\u001B[39m     \u001B[38;5;66;03m# was passed to throw().  This prevents a StopIteration\u001B[39;00m\n\u001B[32m    162\u001B[39m     \u001B[38;5;66;03m# raised inside the \"with\" statement from being suppressed.\u001B[39;00m\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpcore\\_exceptions.py:14\u001B[39m, in \u001B[36mmap_exceptions\u001B[39m\u001B[34m(map)\u001B[39m\n\u001B[32m     13\u001B[39m     \u001B[38;5;28;01mif\u001B[39;00m \u001B[38;5;28misinstance\u001B[39m(exc, from_exc):\n\u001B[32m---> \u001B[39m\u001B[32m14\u001B[39m         \u001B[38;5;28;01mraise\u001B[39;00m to_exc(exc) \u001B[38;5;28;01mfrom\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[34;01mexc\u001B[39;00m\n\u001B[32m     15\u001B[39m \u001B[38;5;28;01mraise\u001B[39;00m\n",
      "\u001B[31mReadTimeout\u001B[39m: ",
      "\nThe above exception was the direct cause of the following exception:\n",
      "\u001B[31mReadTimeout\u001B[39m                               Traceback (most recent call last)",
      "\u001B[36mCell\u001B[39m\u001B[36m \u001B[39m\u001B[32mIn[17]\u001B[39m\u001B[32m, line 26\u001B[39m\n\u001B[32m     16\u001B[39m \u001B[38;5;66;03m# Ejemplo de uso\u001B[39;00m\n\u001B[32m     17\u001B[39m jobs_to_send = [\n\u001B[32m     18\u001B[39m     {\n\u001B[32m     19\u001B[39m         \u001B[33m\"\u001B[39m\u001B[33moperation\u001B[39m\u001B[33m\"\u001B[39m: \u001B[33m\"\u001B[39m\u001B[33mmin_path\u001B[39m\u001B[33m\"\u001B[39m,\n\u001B[32m   (...)\u001B[39m\u001B[32m     23\u001B[39m     }\n\u001B[32m     24\u001B[39m ] * \u001B[32m10\u001B[39m\n\u001B[32m---> \u001B[39m\u001B[32m26\u001B[39m results = \u001B[38;5;28;01mawait\u001B[39;00m send_multiple_jobs(jobs_to_send)\n\u001B[32m     27\u001B[39m \u001B[38;5;28mprint\u001B[39m(results)\n",
      "\u001B[36mCell\u001B[39m\u001B[36m \u001B[39m\u001B[32mIn[17]\u001B[39m\u001B[32m, line 13\u001B[39m, in \u001B[36msend_multiple_jobs\u001B[39m\u001B[34m(job_list)\u001B[39m\n\u001B[32m     11\u001B[39m \u001B[38;5;28;01masync\u001B[39;00m \u001B[38;5;28;01mwith\u001B[39;00m httpx.AsyncClient() \u001B[38;5;28;01mas\u001B[39;00m client:\n\u001B[32m     12\u001B[39m     tasks = [send_job(client, job) \u001B[38;5;28;01mfor\u001B[39;00m job \u001B[38;5;129;01min\u001B[39;00m job_list]\n\u001B[32m---> \u001B[39m\u001B[32m13\u001B[39m     results = \u001B[38;5;28;01mawait\u001B[39;00m asyncio.gather(*tasks)\n\u001B[32m     14\u001B[39m     \u001B[38;5;28;01mreturn\u001B[39;00m results\n",
      "\u001B[36mCell\u001B[39m\u001B[36m \u001B[39m\u001B[32mIn[17]\u001B[39m\u001B[32m, line 6\u001B[39m, in \u001B[36msend_job\u001B[39m\u001B[34m(session, job_data)\u001B[39m\n\u001B[32m      4\u001B[39m \u001B[38;5;28;01masync\u001B[39;00m \u001B[38;5;28;01mdef\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[34msend_job\u001B[39m(session: httpx.AsyncClient, job_data: \u001B[38;5;28mdict\u001B[39m):\n\u001B[32m      5\u001B[39m     url = \u001B[33m\"\u001B[39m\u001B[33mhttp://localhost:3000/jobs\u001B[39m\u001B[33m\"\u001B[39m\n\u001B[32m----> \u001B[39m\u001B[32m6\u001B[39m     response = \u001B[38;5;28;01mawait\u001B[39;00m session.post(url, json=job_data)\n\u001B[32m      7\u001B[39m     response.raise_for_status()\n\u001B[32m      8\u001B[39m     \u001B[38;5;28;01mreturn\u001B[39;00m response.json()\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_client.py:1859\u001B[39m, in \u001B[36mAsyncClient.post\u001B[39m\u001B[34m(self, url, content, data, files, json, params, headers, cookies, auth, follow_redirects, timeout, extensions)\u001B[39m\n\u001B[32m   1838\u001B[39m \u001B[38;5;28;01masync\u001B[39;00m \u001B[38;5;28;01mdef\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[34mpost\u001B[39m(\n\u001B[32m   1839\u001B[39m     \u001B[38;5;28mself\u001B[39m,\n\u001B[32m   1840\u001B[39m     url: URL | \u001B[38;5;28mstr\u001B[39m,\n\u001B[32m   (...)\u001B[39m\u001B[32m   1852\u001B[39m     extensions: RequestExtensions | \u001B[38;5;28;01mNone\u001B[39;00m = \u001B[38;5;28;01mNone\u001B[39;00m,\n\u001B[32m   1853\u001B[39m ) -> Response:\n\u001B[32m   1854\u001B[39m \u001B[38;5;250m    \u001B[39m\u001B[33;03m\"\"\"\u001B[39;00m\n\u001B[32m   1855\u001B[39m \u001B[33;03m    Send a `POST` request.\u001B[39;00m\n\u001B[32m   1856\u001B[39m \n\u001B[32m   1857\u001B[39m \u001B[33;03m    **Parameters**: See `httpx.request`.\u001B[39;00m\n\u001B[32m   1858\u001B[39m \u001B[33;03m    \"\"\"\u001B[39;00m\n\u001B[32m-> \u001B[39m\u001B[32m1859\u001B[39m     \u001B[38;5;28;01mreturn\u001B[39;00m \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m.request(\n\u001B[32m   1860\u001B[39m         \u001B[33m\"\u001B[39m\u001B[33mPOST\u001B[39m\u001B[33m\"\u001B[39m,\n\u001B[32m   1861\u001B[39m         url,\n\u001B[32m   1862\u001B[39m         content=content,\n\u001B[32m   1863\u001B[39m         data=data,\n\u001B[32m   1864\u001B[39m         files=files,\n\u001B[32m   1865\u001B[39m         json=json,\n\u001B[32m   1866\u001B[39m         params=params,\n\u001B[32m   1867\u001B[39m         headers=headers,\n\u001B[32m   1868\u001B[39m         cookies=cookies,\n\u001B[32m   1869\u001B[39m         auth=auth,\n\u001B[32m   1870\u001B[39m         follow_redirects=follow_redirects,\n\u001B[32m   1871\u001B[39m         timeout=timeout,\n\u001B[32m   1872\u001B[39m         extensions=extensions,\n\u001B[32m   1873\u001B[39m     )\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_client.py:1540\u001B[39m, in \u001B[36mAsyncClient.request\u001B[39m\u001B[34m(self, method, url, content, data, files, json, params, headers, cookies, auth, follow_redirects, timeout, extensions)\u001B[39m\n\u001B[32m   1525\u001B[39m     warnings.warn(message, \u001B[38;5;167;01mDeprecationWarning\u001B[39;00m, stacklevel=\u001B[32m2\u001B[39m)\n\u001B[32m   1527\u001B[39m request = \u001B[38;5;28mself\u001B[39m.build_request(\n\u001B[32m   1528\u001B[39m     method=method,\n\u001B[32m   1529\u001B[39m     url=url,\n\u001B[32m   (...)\u001B[39m\u001B[32m   1538\u001B[39m     extensions=extensions,\n\u001B[32m   1539\u001B[39m )\n\u001B[32m-> \u001B[39m\u001B[32m1540\u001B[39m \u001B[38;5;28;01mreturn\u001B[39;00m \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m.send(request, auth=auth, follow_redirects=follow_redirects)\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_client.py:1629\u001B[39m, in \u001B[36mAsyncClient.send\u001B[39m\u001B[34m(self, request, stream, auth, follow_redirects)\u001B[39m\n\u001B[32m   1625\u001B[39m \u001B[38;5;28mself\u001B[39m._set_timeout(request)\n\u001B[32m   1627\u001B[39m auth = \u001B[38;5;28mself\u001B[39m._build_request_auth(request, auth)\n\u001B[32m-> \u001B[39m\u001B[32m1629\u001B[39m response = \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._send_handling_auth(\n\u001B[32m   1630\u001B[39m     request,\n\u001B[32m   1631\u001B[39m     auth=auth,\n\u001B[32m   1632\u001B[39m     follow_redirects=follow_redirects,\n\u001B[32m   1633\u001B[39m     history=[],\n\u001B[32m   1634\u001B[39m )\n\u001B[32m   1635\u001B[39m \u001B[38;5;28;01mtry\u001B[39;00m:\n\u001B[32m   1636\u001B[39m     \u001B[38;5;28;01mif\u001B[39;00m \u001B[38;5;129;01mnot\u001B[39;00m stream:\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_client.py:1657\u001B[39m, in \u001B[36mAsyncClient._send_handling_auth\u001B[39m\u001B[34m(self, request, auth, follow_redirects, history)\u001B[39m\n\u001B[32m   1654\u001B[39m request = \u001B[38;5;28;01mawait\u001B[39;00m auth_flow.\u001B[34m__anext__\u001B[39m()\n\u001B[32m   1656\u001B[39m \u001B[38;5;28;01mwhile\u001B[39;00m \u001B[38;5;28;01mTrue\u001B[39;00m:\n\u001B[32m-> \u001B[39m\u001B[32m1657\u001B[39m     response = \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._send_handling_redirects(\n\u001B[32m   1658\u001B[39m         request,\n\u001B[32m   1659\u001B[39m         follow_redirects=follow_redirects,\n\u001B[32m   1660\u001B[39m         history=history,\n\u001B[32m   1661\u001B[39m     )\n\u001B[32m   1662\u001B[39m     \u001B[38;5;28;01mtry\u001B[39;00m:\n\u001B[32m   1663\u001B[39m         \u001B[38;5;28;01mtry\u001B[39;00m:\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_client.py:1694\u001B[39m, in \u001B[36mAsyncClient._send_handling_redirects\u001B[39m\u001B[34m(self, request, follow_redirects, history)\u001B[39m\n\u001B[32m   1691\u001B[39m \u001B[38;5;28;01mfor\u001B[39;00m hook \u001B[38;5;129;01min\u001B[39;00m \u001B[38;5;28mself\u001B[39m._event_hooks[\u001B[33m\"\u001B[39m\u001B[33mrequest\u001B[39m\u001B[33m\"\u001B[39m]:\n\u001B[32m   1692\u001B[39m     \u001B[38;5;28;01mawait\u001B[39;00m hook(request)\n\u001B[32m-> \u001B[39m\u001B[32m1694\u001B[39m response = \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._send_single_request(request)\n\u001B[32m   1695\u001B[39m \u001B[38;5;28;01mtry\u001B[39;00m:\n\u001B[32m   1696\u001B[39m     \u001B[38;5;28;01mfor\u001B[39;00m hook \u001B[38;5;129;01min\u001B[39;00m \u001B[38;5;28mself\u001B[39m._event_hooks[\u001B[33m\"\u001B[39m\u001B[33mresponse\u001B[39m\u001B[33m\"\u001B[39m]:\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_client.py:1730\u001B[39m, in \u001B[36mAsyncClient._send_single_request\u001B[39m\u001B[34m(self, request)\u001B[39m\n\u001B[32m   1725\u001B[39m     \u001B[38;5;28;01mraise\u001B[39;00m \u001B[38;5;167;01mRuntimeError\u001B[39;00m(\n\u001B[32m   1726\u001B[39m         \u001B[33m\"\u001B[39m\u001B[33mAttempted to send an sync request with an AsyncClient instance.\u001B[39m\u001B[33m\"\u001B[39m\n\u001B[32m   1727\u001B[39m     )\n\u001B[32m   1729\u001B[39m \u001B[38;5;28;01mwith\u001B[39;00m request_context(request=request):\n\u001B[32m-> \u001B[39m\u001B[32m1730\u001B[39m     response = \u001B[38;5;28;01mawait\u001B[39;00m transport.handle_async_request(request)\n\u001B[32m   1732\u001B[39m \u001B[38;5;28;01massert\u001B[39;00m \u001B[38;5;28misinstance\u001B[39m(response.stream, AsyncByteStream)\n\u001B[32m   1733\u001B[39m response.request = request\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_transports\\default.py:393\u001B[39m, in \u001B[36mAsyncHTTPTransport.handle_async_request\u001B[39m\u001B[34m(self, request)\u001B[39m\n\u001B[32m    379\u001B[39m \u001B[38;5;28;01mimport\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[34;01mhttpcore\u001B[39;00m\n\u001B[32m    381\u001B[39m req = httpcore.Request(\n\u001B[32m    382\u001B[39m     method=request.method,\n\u001B[32m    383\u001B[39m     url=httpcore.URL(\n\u001B[32m   (...)\u001B[39m\u001B[32m    391\u001B[39m     extensions=request.extensions,\n\u001B[32m    392\u001B[39m )\n\u001B[32m--> \u001B[39m\u001B[32m393\u001B[39m \u001B[38;5;28;01mwith\u001B[39;00m map_httpcore_exceptions():\n\u001B[32m    394\u001B[39m     resp = \u001B[38;5;28;01mawait\u001B[39;00m \u001B[38;5;28mself\u001B[39m._pool.handle_async_request(req)\n\u001B[32m    396\u001B[39m \u001B[38;5;28;01massert\u001B[39;00m \u001B[38;5;28misinstance\u001B[39m(resp.stream, typing.AsyncIterable)\n",
      "\u001B[36mFile \u001B[39m\u001B[32mC:\\Program Files\\WindowsApps\\PythonSoftwareFoundation.Python.3.12_3.12.2800.0_x64__qbz5n2kfra8p0\\Lib\\contextlib.py:158\u001B[39m, in \u001B[36m_GeneratorContextManager.__exit__\u001B[39m\u001B[34m(self, typ, value, traceback)\u001B[39m\n\u001B[32m    156\u001B[39m     value = typ()\n\u001B[32m    157\u001B[39m \u001B[38;5;28;01mtry\u001B[39;00m:\n\u001B[32m--> \u001B[39m\u001B[32m158\u001B[39m     \u001B[38;5;28;43mself\u001B[39;49m\u001B[43m.\u001B[49m\u001B[43mgen\u001B[49m\u001B[43m.\u001B[49m\u001B[43mthrow\u001B[49m\u001B[43m(\u001B[49m\u001B[43mvalue\u001B[49m\u001B[43m)\u001B[49m\n\u001B[32m    159\u001B[39m \u001B[38;5;28;01mexcept\u001B[39;00m \u001B[38;5;167;01mStopIteration\u001B[39;00m \u001B[38;5;28;01mas\u001B[39;00m exc:\n\u001B[32m    160\u001B[39m     \u001B[38;5;66;03m# Suppress StopIteration *unless* it's the same exception that\u001B[39;00m\n\u001B[32m    161\u001B[39m     \u001B[38;5;66;03m# was passed to throw().  This prevents a StopIteration\u001B[39;00m\n\u001B[32m    162\u001B[39m     \u001B[38;5;66;03m# raised inside the \"with\" statement from being suppressed.\u001B[39;00m\n\u001B[32m    163\u001B[39m     \u001B[38;5;28;01mreturn\u001B[39;00m exc \u001B[38;5;129;01mis\u001B[39;00m \u001B[38;5;129;01mnot\u001B[39;00m value\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\path_service_tscd\\.venv\\Lib\\site-packages\\httpx\\_transports\\default.py:118\u001B[39m, in \u001B[36mmap_httpcore_exceptions\u001B[39m\u001B[34m()\u001B[39m\n\u001B[32m    115\u001B[39m     \u001B[38;5;28;01mraise\u001B[39;00m\n\u001B[32m    117\u001B[39m message = \u001B[38;5;28mstr\u001B[39m(exc)\n\u001B[32m--> \u001B[39m\u001B[32m118\u001B[39m \u001B[38;5;28;01mraise\u001B[39;00m mapped_exc(message) \u001B[38;5;28;01mfrom\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[34;01mexc\u001B[39;00m\n",
      "\u001B[31mReadTimeout\u001B[39m: "
     ]
    }
   ],
   "execution_count": 17
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T13:43:12.706923Z",
     "start_time": "2026-01-03T13:43:12.701986Z"
    }
   },
   "cell_type": "code",
   "source": "[{}] * 10",
   "id": "b26a38e1165b2ebc",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{}, {}, {}, {}, {}, {}, {}, {}, {}, {}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T16:41:48.990892Z",
     "start_time": "2026-01-03T16:41:48.986981Z"
    }
   },
   "cell_type": "code",
   "source": "payload = {'origin_word': None, 'destination_word': None, 'max_depth': 'None', 'degree': 'None'}",
   "id": "e642addf471fa19c",
   "outputs": [],
   "execution_count": 23
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T16:43:08.235032Z",
     "start_time": "2026-01-03T16:43:08.229435Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_valid_payload(payload):\n",
    "    valid_payload = {}\n",
    "    for k, v in payload.items():\n",
    "        if v != 'None' and v is not None:\n",
    "            valid_payload[k] = v\n",
    "    return valid_payload\n",
    "\n",
    "get_valid_payload(payload)"
   ],
   "id": "5f5671cb549c7892",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 29
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T16:42:50.005788Z",
     "start_time": "2026-01-03T16:42:50.000834Z"
    }
   },
   "cell_type": "code",
   "source": "payload.get('origin_word') is not None",
   "id": "910b38283250c365",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "False"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 28
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T16:55:37.629017Z",
     "start_time": "2026-01-03T16:55:37.623411Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from services.graph_operator.queries import queries\n",
    "max_depth = 5\n",
    "queries['all_paths'].format(max_depth=max_depth)"
   ],
   "id": "27492c257b1d7692",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\\n    MATCH (start:Word {value: $start}), (end:Word {value: $end})\\n    MATCH p = (start)-[:CONNECTED*..5]-(end)\\n    RETURN [n IN nodes(p) | n.value] AS path\\n    LIMIT $max_paths\\n    '"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T17:33:38.582834Z",
     "start_time": "2026-01-03T17:33:38.578728Z"
    }
   },
   "cell_type": "code",
   "source": [
    "min_path_query = \"\"\"\n",
    "        MATCH (start:Word {value: $start}), (end:Word {value: $end})\n",
    "        MATCH p = shortestPath((start)-[:CONNECTED*]-(end))\n",
    "        RETURN [n IN nodes(p) | n.value] AS path\n",
    "        \"\"\"\n",
    "\n",
    "all_paths_query = \"\"\"\n",
    "MATCH (start:Word {{value: $start}}),\n",
    "          (end:Word {{value: $end}}),\n",
    "          p = (start)-[*1..{max_depth}]-(end)\n",
    "    RETURN p AS path\n",
    "    LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "max_distance_query = \"\"\"\n",
    "        MATCH (start:Word {value: $start})\n",
    "        MATCH p = (start)-[:CONNECTED*]-(n)\n",
    "        WHERE n <> start\n",
    "        RETURN max(length(p)) AS max_distance\n",
    "        \"\"\"\n",
    "\n",
    "cluster_identification_query = \"\"\"\n",
    "        CALL gds.graph.project('wordGraph', 'Word', 'CONNECTED');\n",
    "        CALL gds.wcc.stream('wordGraph')\n",
    "        YIELD nodeId, componentId\n",
    "        RETURN gds.util.asNode(nodeId).value AS word, componentId\n",
    "        \"\"\"\n",
    "\n",
    "high_connectivity_query = \"\"\"\n",
    "        MATCH (n:Word)-[r:CONNECTED]-()\n",
    "        RETURN n.value AS word, count(r) AS degree\n",
    "        ORDER BY degree DESC\n",
    "        LIMIT $limit\n",
    "        \"\"\"\n",
    "\n",
    "nodes_by_connectivity_query = \"\"\"\n",
    "        MATCH (n:Word)-[r:CONNECTED]-()\n",
    "        WITH n, count(r) AS degree\n",
    "        WHERE degree = $n\n",
    "        RETURN n.value AS word, degree\n",
    "        ORDER BY word\n",
    "        \"\"\"\n",
    "\n",
    "isolated_nodes_query = \"\"\"\n",
    "        MATCH (n:Word)\n",
    "        WHERE NOT (n)-[:CONNECTED]-()\n",
    "        RETURN n.value AS word\n",
    "        \"\"\"\n",
    "\n",
    "queries = {\n",
    "    \"min_path\": min_path_query,\n",
    "    \"all_paths\": all_paths_query,\n",
    "    \"max_distance\": max_distance_query,\n",
    "    \"cluster_identification\": cluster_identification_query,\n",
    "    \"high_connectivity_nodes\": high_connectivity_query,\n",
    "    \"nodes_by_connectivity\": nodes_by_connectivity_query,\n",
    "    \"isolated_nodes\": isolated_nodes_query, }"
   ],
   "id": "ac23d4e54f7ea09c",
   "outputs": [],
   "execution_count": 36
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T17:22:23.871253Z",
     "start_time": "2026-01-03T17:22:23.866912Z"
    }
   },
   "cell_type": "code",
   "source": "all_paths_query.replace(\"{max_depth}\", '5')",
   "id": "679a155819144ba2",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\\nMATCH (start:Word {value: $start}),\\n      (end:Word {value: $end}),\\n      p = (start)-[*1..$max_depth]-(end)\\nWHERE ALL(n IN nodes(p) WHERE single(m IN nodes(p) WHERE m = n))\\nRETURN p\\nLIMIT $max_paths\\n\\n'"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 20
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T17:23:31.885948Z",
     "start_time": "2026-01-03T17:23:31.882043Z"
    }
   },
   "cell_type": "code",
   "source": "print(queries['all_paths'].replace(\"{max_depth}\", str(5)))",
   "id": "ade752cf2f7adf0c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (start:Word {{value: $start}}),\n",
      "          (end:Word {{value: $end}}),\n",
      "          p = (start)-[*1..5]-(end)\n",
      "    RETURN p AS path\n",
      "    LIMIT 50\n",
      "\n"
     ]
    }
   ],
   "execution_count": 24
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T17:34:56.361189Z",
     "start_time": "2026-01-03T17:34:56.352884Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from typing import override\n",
    "from domain.models.graph_job_result import GraphJobResult, get_graph_result\n",
    "from domain.models.job import Job\n",
    "from domain.settings import get_settings\n",
    "from neo4j import GraphDatabase\n",
    "from domain.graph_operator.graph_operator_interface import GraphOperatorInterface\n",
    "\n",
    "settings = get_settings()\n",
    "\n",
    "\n",
    "class Neo4jGraphOperator(GraphOperatorInterface):\n",
    "\n",
    "    def __init__(self):\n",
    "        uri = settings.neo4j_uri\n",
    "        user = settings.neo4j_user\n",
    "        password = settings.neo4j_password\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "        self.operations = {\"min_path\": self.min_path, \"all_paths\": self.all_paths, \"max_distance\": self.max_distance,\n",
    "                           \"cluster_identification\": self.cluster_identification, \"high_connectivity_nodes\": self.high_connectivity_nodes,\n",
    "                           \"nodes_by_connectivity\": self.nodes_by_connectivity, \"isolated_nodes\": self.isolated_nodes\n",
    "                           }\n",
    "\n",
    "    @override\n",
    "    def execute_job(self, job: Job) -> GraphJobResult:\n",
    "        try:\n",
    "            result = self.operations[job.operation](**job.get_valid_payload())\n",
    "            errors = {}\n",
    "        except Exception as e:\n",
    "            result = {}\n",
    "            errors = {\"error\": str(e)}\n",
    "        return get_graph_result(job, result, errors)\n",
    "\n",
    "    @override\n",
    "    def min_path(self, origin_word: str, destination_word: str) -> dict:\n",
    "        with self.driver.session() as session:\n",
    "            record = session.run(queries['min_path'], start=origin_word, end=destination_word).single()\n",
    "\n",
    "        return {\"path\": record[\"path\"] if record else None}\n",
    "\n",
    "    @override\n",
    "    def all_paths(self, origin_word: str, destination_word: str, max_depth=5) -> dict:\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(queries['all_paths'].replace(\"{max_depth}\", str(max_depth)), start=origin_word, end=destination_word)\n",
    "            records = list(result)\n",
    "\n",
    "        return {\"paths\": [r[\"path\"] for r in records]}\n",
    "\n",
    "    @override\n",
    "    def max_distance(self, origin_word: str) -> dict:\n",
    "        with self.driver.session() as session:\n",
    "            record = session.run(queries['max_distance'], start=origin_word).single()\n",
    "            records = list(record)\n",
    "\n",
    "        return {\"max_distance\": records[\"max_distance\"] if records else 0}\n",
    "\n",
    "    @override\n",
    "    def cluster_identification(self) -> dict:\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(queries['cluster_identification'])\n",
    "            records = list(result)\n",
    "\n",
    "        return {\"clusters\": [{\"word\": r[\"word\"], \"component\": r[\"componentId\"]} for r in records]}\n",
    "\n",
    "    @override\n",
    "    def high_connectivity_nodes(self, max_nodes: int = 10) -> dict:\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(queries['high_connectivity_nodes'], limit=max_nodes)\n",
    "            records = list(result)\n",
    "\n",
    "        return {\"nodes\": [{\"word\": r[\"word\"], \"degree\": r[\"degree\"]} for r in records]}\n",
    "\n",
    "    @override\n",
    "    def nodes_by_connectivity(self, n) -> dict:\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(queries['nodes_by_connectivity'], n=n)\n",
    "            records = list(result)\n",
    "\n",
    "        return {\"nodes\": [{\"word\": r[\"word\"], \"degree\": r[\"degree\"]} for r in records]}\n",
    "\n",
    "    @override\n",
    "    def isolated_nodes(self) -> dict:\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(queries['isolated_nodes'])\n",
    "            records = list(result)\n",
    "            words = [r[\"word\"] for r in records]\n",
    "\n",
    "        return {\"isolated_nodes\": words}"
   ],
   "id": "9333d90b1f0f2666",
   "outputs": [],
   "execution_count": 41
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T17:38:02.907882Z",
     "start_time": "2026-01-03T17:38:02.893504Z"
    }
   },
   "cell_type": "code",
   "source": [
    "neo = Neo4jGraphOperator()\n",
    "neo.min_path('say', 'qua')"
   ],
   "id": "54644b578e7de707",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'path': ['say', 'sny', 'any', 'ana', 'aua', 'qua']}"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 50
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-01-03T17:18:03.975411Z",
     "start_time": "2026-01-03T17:18:03.972211Z"
    }
   },
   "cell_type": "code",
   "source": "print(queries['all_paths'])",
   "id": "7aa0e03259686833",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (start:Word {value: $start}),\n",
      "      (end:Word {value: $end}),\n",
      "      p = (start)-[*1..$max_depth]-(end)\n",
      "WHERE ALL(n IN nodes(p) WHERE single(m IN nodes(p) WHERE m = n))\n",
      "RETURN p\n",
      "LIMIT $max_paths\n",
      "\n",
      "\n"
     ]
    }
   ],
   "execution_count": 12
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "1b163157c08bddc1"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
